const countries = ["Австралия", "Австрия", "Азербайджан", "Албания", "Алжир", "Ангола", "Андорра", 
                 "Антигуа и Барбуда", "Антильские острова", "Аргентина", "Армения", "Афганистан", 
                 "Багамские острова", "Бангладеш", "Барбадос", "Бахрейн", "Белиз", "Беларусь", 
                 "Бельгия", "Бенин", "Болгария", "Боливия", "Босния и Герцеговина", "Ботсвана", 
                 "Бразилия", "Буркина-Фасо", "Бурунди", "Бутан", "Вануату", "Ватикан", "Великобритания", 
                 "Венгрия", "Венесуэла", "Вьетнам", "Габон", "Гаити", "Гайана", "Гамбия", "Гана", 
                 "Гватемала", "Гвинея", "Гвинея-Бисау", "Германия", "Голландия", "Гондурас", "Гонконг", 
                 "Гренада", "Гренландия", "Греция", "Грузия", "Гуам", "Дания", "Демократическая Республика Конго", 
                 "Джибути", "Доминиканская республика", "Египет", "Замбия", "Западная Сахара", 
                 "Зимбабве", "Израиль", "Индия", "Индонезия", "Иордания", "Ирак", "Иран", "Ирландия", 
                 "Исландия", "Испания", "Италия", "Йемен", "Кабо-Верде", "Казахстан", "Камбоджа", 
                 "Камерун", "Канада", "Катар", "Кения", "Кипр", "Киргизия", "Кирибати", "Китай", 
                 "КНДР", "Колумбия", "Коморские острова", "Коста-Рика", "Кот-д'Ивуар", "Куба", 
                 "Кувейт", "Лаос", "Латвия", "Лесото", "Либерия", "Ливан", "Ливия", "Литва", 
                 "Лихтенштейн", "Люксембург", "Маврикий", "Мавритания", "Мадагаскар", "Македония", 
                 "Малави", "Малайзия", "Мали", "Мальдивы", "Мальта", "Марокко", "Мартиника", "Мексика", 
                 "Микронезия", "Мозамбик", "Молдавия", "Монако", "Монголия", "Мьянма", "Намибия", 
                 "Непал", "Нигер", "Нигерия", "Никарагуа", "Новая Зеландия", "Новая Каледония", 
                 "Норвегия", "ОАЭ", "Оман", "Пакистан", "Палестина", "Панама", "Папуа-Новая Гвинея", 
                 "Парагвай", "Перу", "Польша", "Португалия", "Пуэрто-Рико", "Республика Конго", 
                 "Республика Корея", "Россия", "Руанда", "Румыния", "Сальвадор", "Сан-Марино", 
                 "Сан-Томе и Принсипи", "Саудовская Аравия", "Свазиленд", "Сенегал", "Сент-Китс и Невис",
                 "Сент-Люсия", "Сербия", "Сингапур", "Сирия", "Словакия", "Словения", "Соломоновы острова", 
                 "Сомали", "Судан", "Суринам", "США", "Сьерра-Леоне", "Таджикистан", "Таиланд", "Тайвань", 
                 "Танзания", "Того", "Тонга", "Тринидад и Тобаго", "Тунис", "Туркменистан", "Турция", 
                 "Уганда", "Узбекистан", "Украина", "Уругвай", "Фиджи", "Филиппины", "Финляндия", "Франция", 
                 "Французская Гвиана", "Хорватия", "Центральноафриканская Республика", "Чад", "Черногория", 
                 "Чехия", "Чили", "Швейцария", "Швеция", "Шри-Ланка", "Эквадор", "Экваториальная Гвинея", 
                 "Эритрея", "Эстония", "Эфиопия", "ЮАР", "Ямайка", "Япония"],

country = document.querySelector('#country'),
countriesList = document.querySelector('#list');

country.addEventListener('input', () => {
  removeChildren(countriesList);
  const curentEnter = toUpperCase(country.value),
        newArr = filterItems(curentEnter);
  
  for (let i = 0; i < newArr.length; i++)  {  
    const newLi = document.createElement('li');
    
    //Вывод списка только при вводе более двух символов
    if( curentEnter.length >= 2) {
      newLi.textContent = newArr[i];
      list.appendChild(newLi); 
      
      newLi.addEventListener('click', () => {
          country.value = newLi.textContent;
          removeChildren(countriesList); 
      });
    }    
  }   
});

//Ищем подходящие элементы в массиве 
function filterItems(filter) {
  return countries.filter((el) => {
      return el.includes(filter);
  })
}

//Делаем первый символ вводимы пользователем заглавным
function toUpperCase(word) {
   return (word.charAt(0).toUpperCase() + word.slice(1));
}

//Удаление старого списка при создании нового поиска
function removeChildren(elem) {
  while (elem.lastChild) {
    elem.removeChild(elem.lastChild);
  }
}
